In [6]:
import pandas as pd

In [7]:
tables = pd.read_html("https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)")
df = tables[0]
print(df)

                                                   0
0  Largest economies in the world by GDP (nominal...

import sqlite3<br>
conn = sqlite3.connect("mydb.sqlite")<br>
df = pd.read_sql("select * from customers", conn)

In [8]:
df = pd.read_csv("data/customers_updated.csv")
df.head()

,customer_id,name,sex,state,age,is_married,active_since,event_time,email
0,C10001,kara cooper,F,montana,76,True,2018-08-13 00:48:59,2024-05-02T13:43:28.295Z,kennethday@example.net
1,C10002,judy erickson,F,new york,76,True,2016-06-18 11:33:39,2024-05-02T13:43:28.296Z,smelendez@example.org
2,C10003,brian galvan,M,alaska,40,False,2017-01-23 19:25:14,2024-05-02T13:43:28.298Z,brianperry@example.net
3,C10004,karen norris,F,wisconsin,68,False,2018-06-15 09:07:32,2024-05-02T13:43:28.300Z,alyssamorgan@example.net
4,C10005,whitney taylor,F,ohio,62,True,2018-07-18 15:53:00,2024-05-02T13:43:28.301Z,cjenkins@example.org

In [9]:
df.tail()

,customer_id,name,sex,state,age,is_married,active_since,event_time,email
9995,C19996,jackie martin,F,delaware,88,False,2018-09-18 00:14:35,2024-05-02T13:43:34.852Z,qblair@example.net
9996,C19997,ashley davis,F,wisconsin,73,False,2016-12-13 03:39:29,2024-05-02T13:43:34.853Z,kimberlydiaz@example.net
9997,C19998,destiny gallagher,F,california,59,False,2017-04-24 21:35:35,2024-05-02T13:43:34.854Z,longjustin@example.net
9998,C19999,elizabeth bradley,F,hawaii,56,True,2019-11-14 21:46:34,2024-05-02T13:43:34.854Z,guerrerosandra@example.org
9999,C20000,jamie ho,F,missouri,38,False,2018-12-08 03:00:01,2024-05-02T13:43:34.855Z,chloe51@example.net

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   10000 non-null  object
 1   name          10000 non-null  object
 2   sex           10000 non-null  object
 3   state         10000 non-null  object
 4   age           10000 non-null  int64
 5   is_married    10000 non-null  bool
 6   active_since  10000 non-null  object
 7   event_time    10000 non-null  object
 8   email         10000 non-null  object
dtypes: bool(1), int64(1), object(7)
memory usage: 634.9+ KB

In [11]:
df.describe()

                age
count  10000.000000
mean      54.387300
std       21.242628
min       18.000000
25%       36.000000
50%       54.000000
75%       73.000000
max       91.000000

In [12]:
df = pd.read_csv("data/customers.csv")
df

,customer_id,name,sex,state,age,is_married,active_since,event_time
0,C1,brooke williams,F,alabama,76,True,2019-03-09 14:43:26,2024-05-02T05:39:10.965Z
1,C2,jim reese,M,oregon,76,True,2016-07-24 05:21:59,2024-05-02T05:39:10.966Z
2,C3,adam walker phd,M,north dakota,40,True,2017-11-21 01:14:51,2024-05-02T05:39:10.967Z
3,C4,nathan roberts,M,louisiana,68,False,2016-11-16 04:44:55,2024-05-02T05:39:10.967Z
4,C5,richard adkins,M,idaho,62,False,2017-03-27 21:09:31,2024-05-02T05:39:10.968Z
...,...,...,...,...,...,...,...,...
9995,C9996,miranda caldwell,F,arizona,88,True,2017-10-23 15:02:09,2024-05-02T05:39:17.063Z
9996,C9997,mark martin,M,new mexico,73,True,2017-02-22 18:13:40,2024-05-02T05:39:17.064Z
9997,C9998,howard hunt,M,vermont,59,True,2017-11-23 14:43:10,2024-05-02T05:39:17.065Z
9998,C9999,alicia phelps,F,michigan,56,False,2016-09-14 16:52:22,2024-05-02T05:39:17.065Z
9999,C10000,kevin williams,M,alaska,38,True,2016-01-10 13:57:17,2024-05-02T05:39:17.066Z

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   10000 non-null  object
 1   name          10000 non-null  object
 2   sex           10000 non-null  object
 3   state         10000 non-null  object
 4   age           10000 non-null  int64
 5   is_married    10000 non-null  bool
 6   active_since  10000 non-null  object
 7   event_time    10000 non-null  object
dtypes: bool(1), int64(1), object(6)
memory usage: 556.8+ KB

In [14]:
df.describe()

                age
count  10000.000000
mean      54.387300
std       21.242628
min       18.000000
25%       36.000000
50%       54.000000
75%       73.000000
max       91.000000

In [15]:
df.shape

(10000, 8)

In [16]:
df.columns

Index(['customer_id', 'name', 'sex', 'state', 'age', 'is_married',
       'active_since', 'event_time'],
      dtype='object')

In [17]:
df["name"].value_counts()

name
michael johnson      8
christopher smith    6
jason johnson        6
jennifer smith       5
jessica jones        5
                    ..
kristi harrington    1
patrick jordan       1
breanna keith        1
joe cook             1
kevin williams       1
Name: count, Length: 9304, dtype: int64

In [18]:
df.index

RangeIndex(start=0, stop=10000, step=1)

In [19]:
df

,customer_id,name,sex,state,age,is_married,active_since,event_time
0,C1,brooke williams,F,alabama,76,True,2019-03-09 14:43:26,2024-05-02T05:39:10.965Z
1,C2,jim reese,M,oregon,76,True,2016-07-24 05:21:59,2024-05-02T05:39:10.966Z
2,C3,adam walker phd,M,north dakota,40,True,2017-11-21 01:14:51,2024-05-02T05:39:10.967Z
3,C4,nathan roberts,M,louisiana,68,False,2016-11-16 04:44:55,2024-05-02T05:39:10.967Z
4,C5,richard adkins,M,idaho,62,False,2017-03-27 21:09:31,2024-05-02T05:39:10.968Z
...,...,...,...,...,...,...,...,...
9995,C9996,miranda caldwell,F,arizona,88,True,2017-10-23 15:02:09,2024-05-02T05:39:17.063Z
9996,C9997,mark martin,M,new mexico,73,True,2017-02-22 18:13:40,2024-05-02T05:39:17.064Z
9997,C9998,howard hunt,M,vermont,59,True,2017-11-23 14:43:10,2024-05-02T05:39:17.065Z
9998,C9999,alicia phelps,F,michigan,56,False,2016-09-14 16:52:22,2024-05-02T05:39:17.065Z
9999,C10000,kevin williams,M,alaska,38,True,2016-01-10 13:57:17,2024-05-02T05:39:17.066Z

In [20]:
df.set_index("customer_id", inplace=True)

In [21]:
df

,name,sex,state,age,is_married,active_since,event_time
customer_id,,,,,,,
C1,brooke williams,F,alabama,76,True,2019-03-09 14:43:26,2024-05-02T05:39:10.965Z
C2,jim reese,M,oregon,76,True,2016-07-24 05:21:59,2024-05-02T05:39:10.966Z
C3,adam walker phd,M,north dakota,40,True,2017-11-21 01:14:51,2024-05-02T05:39:10.967Z
C4,nathan roberts,M,louisiana,68,False,2016-11-16 04:44:55,2024-05-02T05:39:10.967Z
C5,richard adkins,M,idaho,62,False,2017-03-27 21:09:31,2024-05-02T05:39:10.968Z
...,...,...,...,...,...,...,...
C9996,miranda caldwell,F,arizona,88,True,2017-10-23 15:02:09,2024-05-02T05:39:17.063Z
C9997,mark martin,M,new mexico,73,True,2017-02-22 18:13:40,2024-05-02T05:39:17.064Z
C9998,howard hunt,M,vermont,59,True,2017-11-23 14:43:10,2024-05-02T05:39:17.065Z
C9999,alicia phelps,F,michigan,56,False,2016-09-14 16:52:22,2024-05-02T05:39:17.065Z
C10000,kevin williams,M,alaska,38,True,2016-01-10 13:57:17,2024-05-02T05:39:17.066Z

In [22]:
df.reset_index(inplace=True)

In [23]:
df

,customer_id,name,sex,state,age,is_married,active_since,event_time
0,C1,brooke williams,F,alabama,76,True,2019-03-09 14:43:26,2024-05-02T05:39:10.965Z
1,C2,jim reese,M,oregon,76,True,2016-07-24 05:21:59,2024-05-02T05:39:10.966Z
2,C3,adam walker phd,M,north dakota,40,True,2017-11-21 01:14:51,2024-05-02T05:39:10.967Z
3,C4,nathan roberts,M,louisiana,68,False,2016-11-16 04:44:55,2024-05-02T05:39:10.967Z
4,C5,richard adkins,M,idaho,62,False,2017-03-27 21:09:31,2024-05-02T05:39:10.968Z
...,...,...,...,...,...,...,...,...
9995,C9996,miranda caldwell,F,arizona,88,True,2017-10-23 15:02:09,2024-05-02T05:39:17.063Z
9996,C9997,mark martin,M,new mexico,73,True,2017-02-22 18:13:40,2024-05-02T05:39:17.064Z
9997,C9998,howard hunt,M,vermont,59,True,2017-11-23 14:43:10,2024-05-02T05:39:17.065Z
9998,C9999,alicia phelps,F,michigan,56,False,2016-09-14 16:52:22,2024-05-02T05:39:17.065Z
9999,C10000,kevin williams,M,alaska,38,True,2016-01-10 13:57:17,2024-05-02T05:39:17.066Z

In [24]:
df[["customer_id", "name", "sex", "age"]]

     customer_id              name sex  age
0             C1   brooke williams   F   76
1             C2         jim reese   M   76
2             C3   adam walker phd   M   40
3             C4    nathan roberts   M   68
4             C5    richard adkins   M   62
...          ...               ...  ..  ...
9995       C9996  miranda caldwell   F   88
9996       C9997       mark martin   M   73
9997       C9998       howard hunt   M   59
9998       C9999     alicia phelps   F   56
9999      C10000    kevin williams   M   38

[10000 rows x 4 columns]

In [25]:
df.loc[9995]

customer_id                        C9996
name                    miranda caldwell
sex                                    F
state                            arizona
age                                   88
is_married                          True
active_since         2017-10-23 15:02:09
event_time      2024-05-02T05:39:17.063Z
Name: 9995, dtype: object

In [26]:
df.iloc[-5]

customer_id                        C9996
name                    miranda caldwell
sex                                    F
state                            arizona
age                                   88
is_married                          True
active_since         2017-10-23 15:02:09
event_time      2024-05-02T05:39:17.063Z
Name: 9995, dtype: object

In [27]:
df.sort_values("age")

,customer_id,name,sex,state,age,is_married,active_since,event_time
3511,C3512,karen webster,F,vermont,18,False,2019-02-23 00:10:50,2024-05-02T05:39:13.115Z
9690,C9691,sarah wright,F,maine,18,True,2017-07-15 04:47:07,2024-05-02T05:39:16.874Z
292,C293,christopher hayes,M,oregon,18,False,2017-12-12 16:21:40,2024-05-02T05:39:11.153Z
8666,C8667,nicole king,F,ohio,18,False,2016-02-18 20:03:46,2024-05-02T05:39:16.256Z
5478,C5479,tara barrera,F,wisconsin,18,False,2018-07-17 08:54:39,2024-05-02T05:39:14.305Z
...,...,...,...,...,...,...,...,...
4931,C4932,max rodgers,M,oklahoma,91,True,2018-06-21 01:09:56,2024-05-02T05:39:13.978Z
456,C457,jerry banks,M,new hampshire,91,True,2016-06-20 05:33:05,2024-05-02T05:39:11.251Z
4903,C4904,nicholas maldonado,M,minnesota,91,False,2019-05-12 02:19:04,2024-05-02T05:39:13.962Z
8662,C8663,jay frey,M,illinois,91,True,2018-11-12 07:42:56,2024-05-02T05:39:16.254Z
4999,C5000,angela hall,F,michigan,91,False,2019-10-30 08:57:19,2024-05-02T05:39:14.019Z

In [28]:
df

,customer_id,name,sex,state,age,is_married,active_since,event_time
0,C1,brooke williams,F,alabama,76,True,2019-03-09 14:43:26,2024-05-02T05:39:10.965Z
1,C2,jim reese,M,oregon,76,True,2016-07-24 05:21:59,2024-05-02T05:39:10.966Z
2,C3,adam walker phd,M,north dakota,40,True,2017-11-21 01:14:51,2024-05-02T05:39:10.967Z
3,C4,nathan roberts,M,louisiana,68,False,2016-11-16 04:44:55,2024-05-02T05:39:10.967Z
4,C5,richard adkins,M,idaho,62,False,2017-03-27 21:09:31,2024-05-02T05:39:10.968Z
...,...,...,...,...,...,...,...,...
9995,C9996,miranda caldwell,F,arizona,88,True,2017-10-23 15:02:09,2024-05-02T05:39:17.063Z
9996,C9997,mark martin,M,new mexico,73,True,2017-02-22 18:13:40,2024-05-02T05:39:17.064Z
9997,C9998,howard hunt,M,vermont,59,True,2017-11-23 14:43:10,2024-05-02T05:39:17.065Z
9998,C9999,alicia phelps,F,michigan,56,False,2016-09-14 16:52:22,2024-05-02T05:39:17.065Z
9999,C10000,kevin williams,M,alaska,38,True,2016-01-10 13:57:17,2024-05-02T05:39:17.066Z

In [29]:
df.loc[100:120, "name":"age"]

                  name sex           state  age
100      mark ferguson   M      new jersey   38
101     melvin bennett   M           maine   24
102     michael moreno   M        nebraska   78
103        mark brooks   M          nevada   24
104       jane sampson   F         vermont   43
105     michael carson   M           maine   49
106   mitchell roberts   M            utah   38
107  zachary patterson   M      new mexico   30
108     jerry williams   M  south carolina   22
109    elizabeth jones   F     connecticut   35
110   dominique warren   F        illinois   45
111        amanda reid   F        illinois   29
112      james leonard   M      washington   33
113     phyllis cooper   F        delaware   50
114          julie ali   F       minnesota   26
115          jake lane   M        maryland   69
116    jeffery shelton   M     connecticut   22
117       jason barton   M     mississippi   87
118      matthew lewis   M           texas   72
119      susan sanchez   F       minnesota   78
120       carla fowler   F         arizona   75

In [30]:
df["age"].mean()

54.3873

In [31]:
df = pd.DataFrame({
    'Department': ['IT', 'HR', 'IT', 'HR', 'Finance'],
    'Salary': [50000, 40000, 55000, 45000, 60000],
    'Bonus': [5000, 4000, 5500, 4200, 6000]
})

# Aggregate by Department
result = df.groupby("Department").agg({
    "Salary": ["mean", "max"],
    "Bonus": "sum",
    "Department": "count"
})

result

             Salary         Bonus Department
               mean    max    sum      count
Department
Finance     60000.0  60000   6000          1
HR          42500.0  45000   8200          2
IT          52500.0  55000  10500          2

In [32]:
df

  Department  Salary  Bonus
0         IT   50000   5000
1         HR   40000   4000
2         IT   55000   5500
3         HR   45000   4200
4    Finance   60000   6000

In [33]:
df["Salary"].mean()

50000.0

In [34]:
df["Salary"].median()

50000.0

In [35]:
df["Salary"].max()

60000

In [36]:
df.columns

Index(['Department', 'Salary', 'Bonus'], dtype='object')

In [37]:
df = pd.read_csv("data/customers.csv")
df

,customer_id,name,sex,state,age,is_married,active_since,event_time
0,C1,brooke williams,F,alabama,76,True,2019-03-09 14:43:26,2024-05-02T05:39:10.965Z
1,C2,jim reese,M,oregon,76,True,2016-07-24 05:21:59,2024-05-02T05:39:10.966Z
2,C3,adam walker phd,M,north dakota,40,True,2017-11-21 01:14:51,2024-05-02T05:39:10.967Z
3,C4,nathan roberts,M,louisiana,68,False,2016-11-16 04:44:55,2024-05-02T05:39:10.967Z
4,C5,richard adkins,M,idaho,62,False,2017-03-27 21:09:31,2024-05-02T05:39:10.968Z
...,...,...,...,...,...,...,...,...
9995,C9996,miranda caldwell,F,arizona,88,True,2017-10-23 15:02:09,2024-05-02T05:39:17.063Z
9996,C9997,mark martin,M,new mexico,73,True,2017-02-22 18:13:40,2024-05-02T05:39:17.064Z
9997,C9998,howard hunt,M,vermont,59,True,2017-11-23 14:43:10,2024-05-02T05:39:17.065Z
9998,C9999,alicia phelps,F,michigan,56,False,2016-09-14 16:52:22,2024-05-02T05:39:17.065Z
9999,C10000,kevin williams,M,alaska,38,True,2016-01-10 13:57:17,2024-05-02T05:39:17.066Z

In [38]:
df.groupby("state").count()

,customer_id,name,sex,age,is_married,active_since,event_time
state,,,,,,,
alabama,207,207,207,207,207,207,207
alaska,193,193,193,193,193,193,193
arizona,201,201,201,201,201,201,201
arkansas,223,223,223,223,223,223,223
california,216,216,216,216,216,216,216
colorado,208,208,208,208,208,208,208
connecticut,192,192,192,192,192,192,192
delaware,193,193,193,193,193,193,193
florida,199,199,199,199,199,199,199
georgia,203,203,203,203,203,203,203
hawaii,216,216,216,216,216,216,216
idaho,190,190,190,190,190,190,190
illinois,208,208,208,208,208,208,208
indiana,194,194,194,194,194,194,194
iowa,191,191,191,191,191,191,191
kansas,187,187,187,187,187,187,187
kentucky,189,189,189,189,189,189,189
louisiana,207,207,207,207,207,207,207
maine,208,208,208,208,208,208,208
maryland,171,171,171,171,171,171,171
massachusetts,210,210,210,210,210,210,210
michigan,192,192,192,192,192,192,192
minnesota,232,232,232,232,232,232,232
mississippi,192,192,192,192,192,192,192
missouri,201,201,201,201,201,201,201
montana,204,204,204,204,204,204,204
nebraska,200,200,200,200,200,200,200
nevada,210,210,210,210,210,210,210
new hampshire,170,170,170,170,170,170,170
new jersey,212,212,212,212,212,212,212
new mexico,202,202,202,202,202,202,202
new york,203,203,203,203,203,203,203
north carolina,200,200,200,200,200,200,200
north dakota,197,197,197,197,197,197,197
ohio,203,203,203,203,203,203,203
oklahoma,196,196,196,196,196,196,196
oregon,201,201,201,201,201,201,201
pennsylvania,215,215,215,215,215,215,215
rhode island,182,182,182,182,182,182,182
south carolina,195,195,195,195,195,195,195
south dakota,189,189,189,189,189,189,189
tennessee,206,206,206,206,206,206,206
texas,185,185,185,185,185,185,185
utah,223,223,223,223,223,223,223
vermont,221,221,221,221,221,221,221
virginia,196,196,196,196,196,196,196
washington,181,181,181,181,181,181,181
west virginia,194,194,194,194,194,194,194
wisconsin,207,207,207,207,207,207,207
wyoming,185,185,185,185,185,185,185

In [39]:
df = pd.DataFrame({
    'Department': ['IT', 'HR', 'IT', 'HR', 'Finance'],
    'Salary': [50000, 40000, 55000, 45000, 60000],
    'Bonus': [5000, 4000, 5500, 4200, 6000]
})

In [40]:
result = df.groupby("Department").agg({
    "Salary": ["mean", "min", "max"],
    "Bonus": "sum",
    "Department": "count"
})

In [41]:
result

             Salary                Bonus Department
               mean    min    max    sum      count
Department
Finance     60000.0  60000  60000   6000          1
HR          42500.0  40000  45000   8200          2
IT          52500.0  50000  55000  10500          2

In [42]:
df = pd.read_csv("data/customers_updated.csv")
df.head()

,customer_id,name,sex,state,age,is_married,active_since,event_time,email
0,C10001,kara cooper,F,montana,76,True,2018-08-13 00:48:59,2024-05-02T13:43:28.295Z,kennethday@example.net
1,C10002,judy erickson,F,new york,76,True,2016-06-18 11:33:39,2024-05-02T13:43:28.296Z,smelendez@example.org
2,C10003,brian galvan,M,alaska,40,False,2017-01-23 19:25:14,2024-05-02T13:43:28.298Z,brianperry@example.net
3,C10004,karen norris,F,wisconsin,68,False,2018-06-15 09:07:32,2024-05-02T13:43:28.300Z,alyssamorgan@example.net
4,C10005,whitney taylor,F,ohio,62,True,2018-07-18 15:53:00,2024-05-02T13:43:28.301Z,cjenkins@example.org

In [43]:
df.groupby("state")["sex"].value_counts()

state          sex
alabama        M      111
               F      102
alaska         F      109
               M      102
arizona        M      103
                     ...
west virginia  M       91
wisconsin      M      111
               F       93
wyoming        M      111
               F       91
Name: count, Length: 100, dtype: int64

In [44]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Carol"],
    "Math": [90, 70, 80],
    "Science": [85, 75, 95]
})
df

    Name  Math  Science
0  Alice    90       85
1    Bob    70       75
2  Carol    80       95

In [45]:
def total_score(x):
    return x["Math"] * 0.4 + x["Science"] * 0.6

In [46]:
df["Final Score"] = df.apply(total_score, axis=1)
df

    Name  Math  Science  Final Score
0  Alice    90       85         87.0
1    Bob    70       75         73.0
2  Carol    80       95         89.0

In [47]:
def check(x):
    return x + x

In [48]:
df.apply(check)

         Name  Math  Science  Final Score
0  AliceAlice   180      170        174.0
1      BobBob   140      150        146.0
2  CarolCarol   160      190        178.0

In [49]:
df

    Name  Math  Science  Final Score
0  Alice    90       85         87.0
1    Bob    70       75         73.0
2  Carol    80       95         89.0

In [50]:
df = pd.read_csv("data/customers_updated.csv")
df

,customer_id,name,sex,state,age,is_married,active_since,event_time,email
0,C10001,kara cooper,F,montana,76,True,2018-08-13 00:48:59,2024-05-02T13:43:28.295Z,kennethday@example.net
1,C10002,judy erickson,F,new york,76,True,2016-06-18 11:33:39,2024-05-02T13:43:28.296Z,smelendez@example.org
2,C10003,brian galvan,M,alaska,40,False,2017-01-23 19:25:14,2024-05-02T13:43:28.298Z,brianperry@example.net
3,C10004,karen norris,F,wisconsin,68,False,2018-06-15 09:07:32,2024-05-02T13:43:28.300Z,alyssamorgan@example.net
4,C10005,whitney taylor,F,ohio,62,True,2018-07-18 15:53:00,2024-05-02T13:43:28.301Z,cjenkins@example.org
...,...,...,...,...,...,...,...,...,...
9995,C19996,jackie martin,F,delaware,88,False,2018-09-18 00:14:35,2024-05-02T13:43:34.852Z,qblair@example.net
9996,C19997,ashley davis,F,wisconsin,73,False,2016-12-13 03:39:29,2024-05-02T13:43:34.853Z,kimberlydiaz@example.net
9997,C19998,destiny gallagher,F,california,59,False,2017-04-24 21:35:35,2024-05-02T13:43:34.854Z,longjustin@example.net
9998,C19999,elizabeth bradley,F,hawaii,56,True,2019-11-14 21:46:34,2024-05-02T13:43:34.854Z,guerrerosandra@example.org
9999,C20000,jamie ho,F,missouri,38,False,2018-12-08 03:00:01,2024-05-02T13:43:34.855Z,chloe51@example.net

In [51]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Length: 10000, dtype: bool

In [52]:
pd.set_option("display.max_rows", 1000)
pd.set_option("display.max_columns", 20)

In [53]:
df.duplicated(subset="name")

0       False
1       False
2       False
3       False
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Length: 10000, dtype: bool

In [54]:
df["name"].value_counts()

name
michael johnson      6
michael phillips     6
christopher smith    6
james smith          6
jessica smith        5
                    ..
annette reid         1
sergio taylor        1
samantha hicks md    1
joseph brooks        1
jamie ho             1
Name: count, Length: 9367, dtype: int64

In [55]:
# .duplicated() checks whether a row or value is repeated in a DataFrame.
df1 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Alice", "David"],
    "City": ["Delhi", "Mumbai", "Delhi", "Chennai"]
})

In [56]:
df1.duplicated(subset="Name")

0    False
1    False
2     True
3    False
dtype: bool

In [57]:
df1 = pd.DataFrame({
    "Department": ["IT", "IT", "HR", "HR", "Finance"],
    "Gender": ["M", "F", "M", "F", "F"],
    "Salary": [50000, 55000, 40000, 45000, 60000]
})
df1

  Department Gender  Salary
0         IT      M   50000
1         IT      F   55000
2         HR      M   40000
3         HR      F   45000
4    Finance      F   60000

In [58]:
pivot = pd.pivot_table(df1, values="Salary", index="Department", columns="Gender", aggfunc="mean")
pivot

Gender            F        M
Department
Finance     60000.0      NaN
HR          45000.0  40000.0
IT          55000.0  50000.0

In [59]:
df = pd.DataFrame({
    "customer_id": [101, 102, 103, 104, 105],
    "name": ["Alice", "Bob", "Carol", "David", "Eva"],
    "sex": ["F", "M", "F", "M", "F"],
    "state": ["MH", "DL", "KA", "MH", "KA"],
    "age": [25, 40, 35, 60, 22],
    "is_married": [True, False, True, True, False],
    "active_since": pd.to_datetime(["2018-05-01", "2019-07-23", "2020-01-15", "2015-12-31", "2021-06-11"]),
    "event_time": pd.to_datetime(
        ["2024-01-01 10:30", "2024-01-03 14:00", "2024-01-04 09:15", "2024-01-05 16:45", "2024-01-06 12:00"]),
    "email": ["alice@example.com", "bob@example.com", "carol@example.com", None, "eva@example.com"]
})

In [60]:
df

,customer_id,name,sex,state,age,is_married,active_since,event_time,email
0,101,Alice,F,MH,25,True,2018-05-01,2024-01-01 10:30:00,alice@example.com
1,102,Bob,M,DL,40,False,2019-07-23,2024-01-03 14:00:00,bob@example.com
2,103,Carol,F,KA,35,True,2020-01-15,2024-01-04 09:15:00,carol@example.com
3,104,David,M,MH,60,True,2015-12-31,2024-01-05 16:45:00,None
4,105,Eva,F,KA,22,False,2021-06-11,2024-01-06 12:00:00,eva@example.com

In [61]:
df.sort_values("age")

,customer_id,name,sex,state,age,is_married,active_since,event_time,email
4,105,Eva,F,KA,22,False,2021-06-11,2024-01-06 12:00:00,eva@example.com
0,101,Alice,F,MH,25,True,2018-05-01,2024-01-01 10:30:00,alice@example.com
2,103,Carol,F,KA,35,True,2020-01-15,2024-01-04 09:15:00,carol@example.com
1,102,Bob,M,DL,40,False,2019-07-23,2024-01-03 14:00:00,bob@example.com
3,104,David,M,MH,60,True,2015-12-31,2024-01-05 16:45:00,None

In [62]:
df.sort_values("age", ascending=False)

,customer_id,name,sex,state,age,is_married,active_since,event_time,email
3,104,David,M,MH,60,True,2015-12-31,2024-01-05 16:45:00,None
1,102,Bob,M,DL,40,False,2019-07-23,2024-01-03 14:00:00,bob@example.com
2,103,Carol,F,KA,35,True,2020-01-15,2024-01-04 09:15:00,carol@example.com
0,101,Alice,F,MH,25,True,2018-05-01,2024-01-01 10:30:00,alice@example.com
4,105,Eva,F,KA,22,False,2021-06-11,2024-01-06 12:00:00,eva@example.com

In [63]:
df.sort_index()

,customer_id,name,sex,state,age,is_married,active_since,event_time,email
0,101,Alice,F,MH,25,True,2018-05-01,2024-01-01 10:30:00,alice@example.com
1,102,Bob,M,DL,40,False,2019-07-23,2024-01-03 14:00:00,bob@example.com
2,103,Carol,F,KA,35,True,2020-01-15,2024-01-04 09:15:00,carol@example.com
3,104,David,M,MH,60,True,2015-12-31,2024-01-05 16:45:00,None
4,105,Eva,F,KA,22,False,2021-06-11,2024-01-06 12:00:00,eva@example.com

In [64]:
df.reset_index()

,index,customer_id,name,sex,state,age,is_married,active_since,event_time,email
0,0,101,Alice,F,MH,25,True,2018-05-01,2024-01-01 10:30:00,alice@example.com
1,1,102,Bob,M,DL,40,False,2019-07-23,2024-01-03 14:00:00,bob@example.com
2,2,103,Carol,F,KA,35,True,2020-01-15,2024-01-04 09:15:00,carol@example.com
3,3,104,David,M,MH,60,True,2015-12-31,2024-01-05 16:45:00,None
4,4,105,Eva,F,KA,22,False,2021-06-11,2024-01-06 12:00:00,eva@example.com

In [65]:
df.drop(columns=["event_time"], inplace=True)

In [66]:
df

,customer_id,name,sex,state,age,is_married,active_since,email
0,101,Alice,F,MH,25,True,2018-05-01,alice@example.com
1,102,Bob,M,DL,40,False,2019-07-23,bob@example.com
2,103,Carol,F,KA,35,True,2020-01-15,carol@example.com
3,104,David,M,MH,60,True,2015-12-31,None
4,105,Eva,F,KA,22,False,2021-06-11,eva@example.com

In [67]:
df.rename(columns={"sex": "gender"}, inplace=True)
df

,customer_id,name,gender,state,age,is_married,active_since,email
0,101,Alice,F,MH,25,True,2018-05-01,alice@example.com
1,102,Bob,M,DL,40,False,2019-07-23,bob@example.com
2,103,Carol,F,KA,35,True,2020-01-15,carol@example.com
3,104,David,M,MH,60,True,2015-12-31,None
4,105,Eva,F,KA,22,False,2021-06-11,eva@example.com

In [68]:
df.drop_duplicates(subset="state")

,customer_id,name,gender,state,age,is_married,active_since,email
0,101,Alice,F,MH,25,True,2018-05-01,alice@example.com
1,102,Bob,M,DL,40,False,2019-07-23,bob@example.com
2,103,Carol,F,KA,35,True,2020-01-15,carol@example.com

In [69]:
df

,customer_id,name,gender,state,age,is_married,active_since,email
0,101,Alice,F,MH,25,True,2018-05-01,alice@example.com
1,102,Bob,M,DL,40,False,2019-07-23,bob@example.com
2,103,Carol,F,KA,35,True,2020-01-15,carol@example.com
3,104,David,M,MH,60,True,2015-12-31,None
4,105,Eva,F,KA,22,False,2021-06-11,eva@example.com

In [70]:
df.sample(frac=0.4, random_state=1)

,customer_id,name,gender,state,age,is_married,active_since,email
2,103,Carol,F,KA,35,True,2020-01-15,carol@example.com
1,102,Bob,M,DL,40,False,2019-07-23,bob@example.com

In [71]:
df.sample(n=2, random_state=322)

,customer_id,name,gender,state,age,is_married,active_since,email
2,103,Carol,F,KA,35,True,2020-01-15,carol@example.com
4,105,Eva,F,KA,22,False,2021-06-11,eva@example.com

In [72]:
df

,customer_id,name,gender,state,age,is_married,active_since,email
0,101,Alice,F,MH,25,True,2018-05-01,alice@example.com
1,102,Bob,M,DL,40,False,2019-07-23,bob@example.com
2,103,Carol,F,KA,35,True,2020-01-15,carol@example.com
3,104,David,M,MH,60,True,2015-12-31,None
4,105,Eva,F,KA,22,False,2021-06-11,eva@example.com

In [73]:
df.nlargest(2, "age")

,customer_id,name,gender,state,age,is_married,active_since,email
3,104,David,M,MH,60,True,2015-12-31,None
1,102,Bob,M,DL,40,False,2019-07-23,bob@example.com

In [74]:
df.nlargest(1, "age")

   customer_id   name gender state  age  is_married active_since email
3          104  David      M    MH   60        True   2015-12-31  None

In [75]:
df.nsmallest(2, "age")

,customer_id,name,gender,state,age,is_married,active_since,email
4,105,Eva,F,KA,22,False,2021-06-11,eva@example.com
0,101,Alice,F,MH,25,True,2018-05-01,alice@example.com

In [76]:
df

,customer_id,name,gender,state,age,is_married,active_since,email
0,101,Alice,F,MH,25,True,2018-05-01,alice@example.com
1,102,Bob,M,DL,40,False,2019-07-23,bob@example.com
2,103,Carol,F,KA,35,True,2020-01-15,carol@example.com
3,104,David,M,MH,60,True,2015-12-31,None
4,105,Eva,F,KA,22,False,2021-06-11,eva@example.com

In [77]:
df.loc[3].at["name"]

'David'

In [78]:
df.at[3, "name"]

'David'

In [79]:
df.iat[3, 1]  # label, index

'David'

In [80]:
df.query("age > 30 and is_married == True")

,customer_id,name,gender,state,age,is_married,active_since,email
2,103,Carol,F,KA,35,True,2020-01-15,carol@example.com
3,104,David,M,MH,60,True,2015-12-31,None

In [81]:
import numpy as np

In [82]:
arr = np.array([
    [[1, 2, 3], [4, 5, 6]],
    [[7, 8, 9], [10, 11, 12]]
])

In [83]:
arr

array([[[ 1,  2,  3],
        [ 4,  5,  6]],

       [[ 7,  8,  9],
        [10, 11, 12]]])

In [84]:
arr[::-1]

array([[[ 7,  8,  9],
        [10, 11, 12]],

       [[ 1,  2,  3],
        [ 4,  5,  6]]])

In [85]:
arr[:, ::-1, :]

array([[[ 4,  5,  6],
        [ 1,  2,  3]],

       [[10, 11, 12],
        [ 7,  8,  9]]])

In [86]:
arr

array([[[ 1,  2,  3],
        [ 4,  5,  6]],

       [[ 7,  8,  9],
        [10, 11, 12]]])

In [87]:
arr[:, :, ::-1]

array([[[ 3,  2,  1],
        [ 6,  5,  4]],

       [[ 9,  8,  7],
        [12, 11, 10]]])

In [88]:
arr

array([[[ 1,  2,  3],
        [ 4,  5,  6]],

       [[ 7,  8,  9],
        [10, 11, 12]]])

In [89]:
arr[::-1, ::-1, ::-1]

array([[[12, 11, 10],
        [ 9,  8,  7]],

       [[ 6,  5,  4],
        [ 3,  2,  1]]])

In [90]:
df.describe().T

,count,mean,min,25%,50%,75%,max,std
customer_id,5.0,103.0,101.0,102.0,103.0,104.0,105.0,1.581139
age,5.0,36.4,22.0,25.0,35.0,40.0,60.0,15.076472
active_since,5,2019-01-27 09:36:00,2015-12-31 00:00:00,2018-05-01 00:00:00,2019-07-23 00:00:00,2020-01-15 00:00:00,2021-06-11 00:00:00,NaN